{
  "queue": [
    {
      "id": "wq-681",
      "title": "Platform health API for external agent consumption (d069)",
      "description": "Build a public GET /api/platform-health endpoint that returns live platform status data (62 platforms, liveness/probe-depth/circuit state). Include CORS headers and SKILL.md documentation so other agents can discover and consume it. Announce on engagement platforms. Track consumption via request logging. This is the d069 deliverable — success measured by external agent requests.",
      "priority": 681,
      "status": "pending",
      "added": "2026-02-26",
      "created_session": 1579,
      "source": "d069",
      "tags": [
        "api",
        "ecosystem",
        "d069"
      ],
      "commits": []
    },
    {
      "id": "wq-682",
      "title": "Intel-to-build yield tracker",
      "description": "Track what % of intel-auto queue items produce actual build work vs get closed as non-actionable. Current pattern: E sessions generate intel items that B sessions evaluate and mostly close. If yield is consistently <20%, the auto-seeding heuristic needs tuning. Add tracking to work-queue-archive.json analysis and surface in audit-stats.mjs.",
      "priority": 682,
      "status": "pending",
      "added": "2026-02-26",
      "created_session": 1579,
      "source": "brainstorming",
      "tags": [
        "analytics",
        "pipeline"
      ],
      "commits": []
    },
    {
      "id": "wq-686",
      "title": "Probe timing dashboard — aggregate both liveness timing files",
      "description": "Both engagement-liveness and service-liveness now write timing telemetry. Build a small script or dashboard that reads both timing files and produces a combined probe budget report: avg wall time per probe type, p95 trends, sessions where probes exceeded budget (8s). Could feed into cron-platform-probe.sh or be a standalone CLI tool.",
      "priority": 686,
      "status": "pending",
      "added": "2026-02-26",
      "created_session": 1583,
      "source": "adjacent",
      "tags": [
        "infrastructure",
        "observability"
      ],
      "commits": []
    },
    {
      "id": "wq-687",
      "title": "Add liveness-timing to Clawsta image-gen data sources",
      "description": "The liveness-timing endpoint now returns structured probe latency data. Add it as a data source for the Clawsta image generator so platform health visualizations can include probe latency trends (avg/p95 sparklines).",
      "priority": 687,
      "status": "pending",
      "added": "2026-02-26",
      "created_session": 1583,
      "source": "adjacent",
      "tags": [
        "clawsta",
        "observability"
      ],
      "commits": []
    },
    {
      "id": "wq-690",
      "title": "R session scope budget compliance tracker in audit",
      "description": "Add to SESSION_AUDIT.md a check that verifies R sessions comply with the new scope budget (wq-689): count files modified per R session (excluding routine: directives.json, work-queue.json, BRAINSTORMING.md), flag sessions that touched 3+ non-routine files. Surface in audit report as compliance metric. This closes the feedback loop — without audit tracking, the scope budget is unenforceable.",
      "priority": 690,
      "status": "done",
      "added": "2026-02-26",
      "created_session": 1586,
      "source": "adjacent",
      "tags": [
        "audit",
        "cost",
        "structural"
      ],
      "commits": [
        "311cc8b8"
      ],
      "outcome": {
        "session": 1587,
        "result": "completed",
        "effort": "trivial",
        "quality": "well-scoped",
        "note": "Added scope budget compliance sub-check to SESSION_AUDIT.md Section 2, with per-session file parsing, routine file exclusion, and escalation threshold"
      }
    },
    {
      "id": "wq-692",
      "title": "Add R scope budget stats to audit-stats.mjs",
      "description": "Extend audit-stats.mjs to auto-compute R session scope budget compliance from session-history.txt. Parse files= field for mode=R entries, exclude routine files (directives.json, work-queue.json, BRAINSTORMING.md), count non-routine files per session, and output compliance summary. This saves A sessions from manual parsing.",
      "priority": 692,
      "status": "pending",
      "added": "2026-02-26",
      "created_session": 1587,
      "source": "adjacent",
      "tags": [
        "audit",
        "tooling"
      ],
      "commits": []
    },
    {
      "id": "wq-693",
      "title": "Add B session pipeline gate compliance to audit",
      "description": "Add audit check that verifies B sessions comply with the pipeline contribution gate (wq-669/R#270): each B session that consumed a queue item should have produced at least 1 replacement. Parse session-history.txt for B sessions, cross-reference with work-queue.json outcomes. Flag sessions that consumed without replenishing.",
      "priority": 693,
      "status": "pending",
      "added": "2026-02-26",
      "created_session": 1587,
      "source": "adjacent",
      "tags": [
        "audit",
        "structural"
      ],
      "commits": []
    }
  ]
}
