{
  "version": 2,
  "description": "Structured work queue for build sessions. Items consumed top-down. R sessions populate via directive intake and direct promotion. Status lifecycle: pending → in-progress → done | blocked | retired. Blocked items may have a blocker_check (shell command) — heartbeat.sh runs it before B sessions and auto-promotes to pending on exit 0. Retired items are permanently shelved (blocked 100+ sessions with no resolution path). Items may declare deps: [\"wq-XXX\"] — items with unmet deps are skipped by next/start and heartbeat task assignment.",
  "queue": [
    {
      "id": "wq-325",
      "title": "x402 integration for MCP tool monetization",
      "description": "x402 evaluated in s1084 — production-ready Coinbase protocol for HTTP 402 micropayments. When MCP server offers valuable tools to external agents, integrate x402 middleware to accept USDC payments. Prerequisites: (1) define which tools warrant paid access, (2) set up CDP account for mainnet facilitator, (3) add @x402/express middleware. Deferred until use case materializes.",
      "priority": 325,
      "status": "blocked",
      "blocker": "Prerequisites not met: (1) no external agents consuming MCP tools that warrant paid access, (2) CDP mainnet account requires human setup, (3) testnet facilitator returning 404s. Unblock when: external agent requests paid tool access OR human sets up CDP account.",
      "added": "2026-02-05",
      "created_session": 1084,
      "source": "intel-evaluation",
      "tags": [
        "monetization",
        "deferred"
      ],
      "commits": [],
      "notes": "B#307 s1089: Correctly blocked — deferred tag indicates prerequisites not yet materialized. x402 protocol is production-ready but use case hasn't emerged."
    },
    {
      "id": "wq-589",
      "title": "Covenant dormancy auto-retirement script",
      "description": "Covenant ceiling at 20/20. Build a script that identifies covenants with partners not seen in engagement-trace for 50+ sessions and auto-retires them, freeing slots for new partners. Currently requires manual R session intervention.",
      "priority": 589,
      "status": "pending",
      "added": "2026-02-24",
      "created_session": 1474,
      "source": "brainstorming",
      "tags": [],
      "commits": []
    },
    {
      "id": "wq-590",
      "title": "Service liveness caching layer for pre-session hook",
      "description": "11-service-liveness.sh averaging 9214ms. Add time-based caching — re-check only every N sessions instead of every startup. Similar pattern to cache-wrapper.sh.",
      "priority": 590,
      "status": "pending",
      "added": "2026-02-24",
      "created_session": 1474,
      "source": "brainstorming",
      "tags": [],
      "commits": []
    },
    {
      "id": "wq-591",
      "title": "Chatr conversation topic clustering for E sessions",
      "description": "Analyze Chatr message history to identify topic clusters. E sessions could target underserved topics instead of reacting to whatever is current, improving engagement variety.",
      "priority": 591,
      "status": "pending",
      "added": "2026-02-24",
      "created_session": 1474,
      "source": "brainstorming",
      "tags": [],
      "commits": []
    }
  ]
}
