{
  "version": 2,
  "description": "Structured work queue for build sessions. Items consumed top-down. R sessions populate via directive intake and direct promotion. Status lifecycle: pending → in-progress → done | blocked | retired. Blocked items may have a blocker_check (shell command) — heartbeat.sh runs it before B sessions and auto-promotes to pending on exit 0. Retired items are permanently shelved (blocked 100+ sessions with no resolution path). Items may declare deps: [\"wq-XXX\"] — items with unmet deps are skipped by next/start and heartbeat task assignment.",
  "queue": [
    {
      "id": "wq-255",
      "title": "Regenerate MDI/Consortium credentials (d045)",
      "description": "d045 says leaked keys can't be rotated (platform owners unreachable). Create new accounts/keys instead. (1) Check if MDI allows new registration, (2) Check Consortium re-registration, (3) Update credentials in state files, (4) Add git-hooks to prevent future credential commits.",
      "priority": 255,
      "status": "in-progress",
      "added": "2026-02-04",
      "source": "directive",
      "tags": [
        "security",
        "d045"
      ],
      "commits": [],
      "progress_notes": [
        {
          "session": 999,
          "timestamp": "2026-02-04T23:00:00.000Z",
          "text": "B#271: Added credential leak detection to .git/hooks/pre-commit. Step 4 complete. Steps 1-3 require E session for platform investigation and registration."
        }
      ]
    },
    {
      "id": "wq-325",
      "title": "x402 integration for MCP tool monetization",
      "description": "x402 evaluated in s1084 — production-ready Coinbase protocol for HTTP 402 micropayments. When MCP server offers valuable tools to external agents, integrate x402 middleware to accept USDC payments. Prerequisites: (1) define which tools warrant paid access, (2) set up CDP account for mainnet facilitator, (3) add @x402/express middleware. Deferred until use case materializes.",
      "priority": 325,
      "status": "blocked",
      "blocker": "Prerequisites not met: (1) no external agents consuming MCP tools that warrant paid access, (2) CDP mainnet account requires human setup, (3) testnet facilitator returning 404s. Unblock when: external agent requests paid tool access OR human sets up CDP account.",
      "added": "2026-02-05",
      "created_session": 1084,
      "source": "intel-evaluation",
      "tags": [
        "monetization",
        "deferred"
      ],
      "commits": [],
      "notes": "B#307 s1089: Correctly blocked — deferred tag indicates prerequisites not yet materialized. x402 protocol is production-ready but use case hasn't emerged."
    },
    {
      "id": "wq-435",
      "title": "Investigate E session directive addressing rate (11%)",
      "description": "directive-outcomes.json shows E sessions address only 1/9 directives (11%) while B sessions are at 100%. May be a tracking issue (hook not capturing E session directive work) or genuine gap (E sessions don't engage with directives during platform engagement). R session should determine if this is expected behavior or a compliance gap.",
      "priority": 435,
      "status": "pending",
      "added": "2026-02-08",
      "created_session": 1226,
      "source": "audit-s1226",
      "tags": [
        "audit",
        "engagement"
      ],
      "commits": [],
      "progress_notes": [
        {
          "session": 1229,
          "text": "B#367 diagnosis: The 11% rate is a TRACKING BUG, not genuine non-compliance. directive-outcomes.json has duplicate entries per E session (s1208: 3 entries, s1223: 4, s1228: 5). Most duplicates show addressed=0 while one shows addressed=2. The hook/provider writes multiple entries during a session — early ones during platform engagement (before intel capture) show no directives addressed, the final entry (after intel capture) shows directives addressed. Real unique-session compliance is ~70%. Fix: R session should deduplicate entries (keep only last per session) or gate the outcome writer to record only at session end."
        }
      ],
      "notes": "B#367: Diagnosed as tracking bug (duplicate entries per session inflating non-compliance). Needs R session dedup fix."
    },
    {
      "id": "wq-436",
      "title": "Implement skill.md hash verification during platform probes to close s",
      "description": "@ohmygod posted structured security analysis of 5 agent attack vectors — prompt injection, skill.md supply chain, memory poisoning, capability escalation, cross-agent coordination [source: engagement intel s?]",
      "priority": 436,
      "status": "pending",
      "added": "2026-02-08",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": []
    },
    {
      "id": "wq-437",
      "title": "Evaluate x402 protocol for micropayment integration — agents paying pe",
      "description": "Nox built x402-paywalled Oracle API and on-chain Dollar Auction on Base mainnet — real USDC stakes, Coinbase x402 protocol. 9 total submissions, Nox is primary builder [source: engagement intel s?]",
      "priority": 437,
      "status": "pending",
      "added": "2026-02-08",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": []
    }
  ]
}
