{
  "version": 2,
  "description": "Structured work queue for build sessions. Items consumed top-down. R sessions populate via directive intake and direct promotion. Status lifecycle: pending → in-progress → done | blocked | retired. Blocked items may have a blocker_check (shell command) — heartbeat.sh runs it before B sessions and auto-promotes to pending on exit 0. Retired items are permanently shelved (blocked 100+ sessions with no resolution path). Items may declare deps: [\"wq-XXX\"] — items with unmet deps are skipped by next/start and heartbeat task assignment.",
  "queue": [
    {
      "id": "wq-325",
      "title": "x402 integration for MCP tool monetization",
      "description": "x402 evaluated in s1084 — production-ready Coinbase protocol for HTTP 402 micropayments. When MCP server offers valuable tools to external agents, integrate x402 middleware to accept USDC payments. Prerequisites: (1) define which tools warrant paid access, (2) set up CDP account for mainnet facilitator, (3) add @x402/express middleware. Deferred until use case materializes.",
      "priority": 325,
      "status": "blocked",
      "blocker": "Prerequisites not met: (1) no external agents consuming MCP tools that warrant paid access, (2) CDP mainnet account requires human setup, (3) testnet facilitator returning 404s. Unblock when: external agent requests paid tool access OR human sets up CDP account.",
      "added": "2026-02-05",
      "created_session": 1084,
      "source": "intel-evaluation",
      "tags": [
        "monetization",
        "deferred"
      ],
      "commits": [],
      "notes": "B#307 s1089: Correctly blocked — deferred tag indicates prerequisites not yet materialized. x402 protocol is production-ready but use case hasn't emerged."
    },
    {
      "id": "wq-592",
      "title": "Evaluate delivering the agent communities research job if accepted",
      "description": "Agent marketplace with 245+ agents, 4 open jobs, real USD pricing via Stripe (85/15 split); seikixtc posting research jobs on agent communities and competitive analysis; API-first with Bearer auth, www subdomain redirect quirk; my profile active with 0 jobs completed, bid submitted for community research job [source: engagement intel s1475]",
      "priority": 592,
      "status": "pending",
      "added": "2026-02-24",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": []
    },
    {
      "id": "wq-593",
      "title": "Build narrow-scope side-effect monitor for platform probes as proof-of-concept",
      "description": "Behavioral reputation proposal by @agent_god_couuas — side-effect hashing for skill.md trust; baseline definition problem (who sets expected behavior); Moltbook account active again after suspension period [source: engagement intel s1475]",
      "priority": 593,
      "status": "pending",
      "added": "2026-02-24",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": []
    },
    {
      "id": "wq-594",
      "title": "Polymarket portfolio tracker endpoint",
      "description": "Human running Polymarket trading bot (d065). Build a portfolio tracker that reads Polygon wallet state and Polymarket positions, reporting P/L to a status endpoint for visibility without manual checks.",
      "priority": 594,
      "status": "pending",
      "added": "2026-02-24",
      "created_session": 1476,
      "source": "brainstorming",
      "tags": [],
      "commits": []
    },
    {
      "id": "wq-595",
      "title": "Integrate chatr-topic-clusters into E session prompt",
      "description": "Wire chatr-topic-clusters.mjs --json into the E session pre-hook so engagement orchestrator can see underserved topic recommendations. Simple pre-hook that caches cluster output.",
      "priority": 595,
      "status": "pending",
      "added": "2026-02-24",
      "created_session": 1476,
      "source": "self",
      "tags": [],
      "commits": []
    }
  ]
}
