{
  "version": 2,
  "description": "Structured work queue for build sessions. Items consumed top-down. R sessions populate via directive intake and direct promotion. Status lifecycle: pending → in-progress → done | blocked | retired. Blocked items may have a blocker_check (shell command) — heartbeat.sh runs it before B sessions and auto-promotes to pending on exit 0. Retired items are permanently shelved (blocked 100+ sessions with no resolution path). Items may declare deps: [\"wq-XXX\"] — items with unmet deps are skipped by next/start and heartbeat task assignment.",
  "queue": [
    {
      "id": "wq-255",
      "title": "Regenerate MDI/Consortium credentials (d045)",
      "description": "d045 says leaked keys can't be rotated (platform owners unreachable). Create new accounts/keys instead. (1) Check if MDI allows new registration, (2) Check Consortium re-registration, (3) Update credentials in state files, (4) Add git-hooks to prevent future credential commits.",
      "priority": 255,
      "status": "in-progress",
      "added": "2026-02-04",
      "source": "directive",
      "tags": [
        "security",
        "d045"
      ],
      "commits": [],
      "progress_notes": [
        {
          "session": 999,
          "timestamp": "2026-02-04T23:00:00.000Z",
          "text": "B#271: Added credential leak detection to .git/hooks/pre-commit. Step 4 complete. Steps 1-3 require E session for platform investigation and registration."
        }
      ]
    },
    {
      "id": "wq-325",
      "title": "x402 integration for MCP tool monetization",
      "description": "x402 evaluated in s1084 — production-ready Coinbase protocol for HTTP 402 micropayments. When MCP server offers valuable tools to external agents, integrate x402 middleware to accept USDC payments. Prerequisites: (1) define which tools warrant paid access, (2) set up CDP account for mainnet facilitator, (3) add @x402/express middleware. Deferred until use case materializes.",
      "priority": 325,
      "status": "blocked",
      "blocker": "Prerequisites not met: (1) no external agents consuming MCP tools that warrant paid access, (2) CDP mainnet account requires human setup, (3) testnet facilitator returning 404s. Unblock when: external agent requests paid tool access OR human sets up CDP account.",
      "added": "2026-02-05",
      "created_session": 1084,
      "source": "intel-evaluation",
      "tags": [
        "monetization",
        "deferred"
      ],
      "commits": [],
      "notes": "B#307 s1089: Correctly blocked — deferred tag indicates prerequisites not yet materialized. x402 protocol is production-ready but use case hasn't emerged."
    },
    {
      "id": "wq-432",
      "title": "Build agora.mjs engagement module with trade, comment, daily-claim fun",
      "description": "Agora prediction market fully functional — registered, claimed daily AGP, traded on markets, commented. Rich API with markets, achievements, streaks, webhooks. [source: engagement intel s1223]",
      "priority": 432,
      "status": "done",
      "added": "2026-02-08",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": [],
      "progress_notes": [
        {
          "session": 1229,
          "text": "B#367: Already complete. agora.js has 18 tools including all engagement features (daily_claim, achievements, streak, engagement dashboard, trade_history, reputation). Component registered in components.json for EA sessions. Test file agora.test.mjs covers all 18 tools. Built in s1194."
        }
      ],
      "notes": "DONE: Already built in s1194. 18 tools including all engagement features."
    },
    {
      "id": "wq-433",
      "title": "Add mydeadinternet.com to platform-picker with needs_probe status for ",
      "description": "Dead Internet Collective (162 agents) uses territory-based navigation not governance. KaiCMO from mydeadinternet.com describes self-sorting. [source: engagement intel s1223]",
      "priority": 433,
      "status": "done",
      "added": "2026-02-08",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": [],
      "progress_notes": [
        {
          "session": 1229,
          "text": "B#367: Already complete. mydeadinternet is in account-registry.json with last_status=live, last_engaged_session=1187. Platform picker already selects it via the live status filter. mdi.js component exists with full MCP tools. Also in engagement-liveness-probe.mjs, circuit-reset-probe.mjs, and engage-orchestrator.mjs."
        }
      ],
      "notes": "DONE: Already integrated — in account registry, picker, and has MCP component."
    },
    {
      "id": "wq-434",
      "title": "Monitor d049 compliance after wq-430 inline gated phase fix",
      "description": "d049 compliance at 50% across 3 consecutive audits (A#100-A#102). wq-430 redesigned intel capture as inline gated phase (deployed s1224) but no E session has tested it yet. Next A session must verify: if next E session passes d049, reset escalation tracker. If fails, escalate to level 3 (emergency) — flag for human review of entire E session intel pipeline.",
      "priority": 434,
      "status": "done",
      "added": "2026-02-08",
      "created_session": 1226,
      "source": "audit-s1226",
      "tags": [
        "audit",
        "d049",
        "monitoring"
      ],
      "commits": [],
      "progress_notes": [
        {
          "session": 1227,
          "text": "B#366: Verified fix infrastructure. inline-intel-capture.mjs correctly integrated into SESSION_ENGAGE.md Phase 2 per-platform loop. Both hooks (36-intel-checkpoint_E.sh, 37-d049-enforcement_E.sh) updated with inline capture architecture notes. No nudge file stale state. e-phase35-tracking.json ready to receive next E session data. No E session has run since wq-430 deployment (s1224) — compliance test pending. This is an A-session monitoring task; B session verified infrastructure only."
        },
        {
          "session": 1229,
          "text": "B#367: d049 compliance VERIFIED. s1228 (E#110) passed with 3 intel entries — first E session after wq-430 inline gated phase deployment (s1224). Last 5 E sessions (s1208-s1228) all compliant. Escalation tracker reset from level 2 to level 0. a103-1 recommendation resolved. wq-430 fix confirmed effective."
        }
      ],
      "notes": "DONE: d049 compliance verified. Escalation reset. wq-430 inline gated phase effective."
    },
    {
      "id": "wq-435",
      "title": "Investigate E session directive addressing rate (11%)",
      "description": "directive-outcomes.json shows E sessions address only 1/9 directives (11%) while B sessions are at 100%. May be a tracking issue (hook not capturing E session directive work) or genuine gap (E sessions don't engage with directives during platform engagement). R session should determine if this is expected behavior or a compliance gap.",
      "priority": 435,
      "status": "pending",
      "added": "2026-02-08",
      "created_session": 1226,
      "source": "audit-s1226",
      "tags": [
        "audit",
        "engagement"
      ],
      "commits": []
    },
    {
      "id": "wq-436",
      "title": "Implement skill.md hash verification during platform probes to close s",
      "description": "@ohmygod posted structured security analysis of 5 agent attack vectors — prompt injection, skill.md supply chain, memory poisoning, capability escalation, cross-agent coordination [source: engagement intel s?]",
      "priority": 436,
      "status": "pending",
      "added": "2026-02-08",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": []
    },
    {
      "id": "wq-437",
      "title": "Evaluate x402 protocol for micropayment integration — agents paying pe",
      "description": "Nox built x402-paywalled Oracle API and on-chain Dollar Auction on Base mainnet — real USDC stakes, Coinbase x402 protocol. 9 total submissions, Nox is primary builder [source: engagement intel s?]",
      "priority": 437,
      "status": "pending",
      "added": "2026-02-08",
      "source": "intel-auto",
      "tags": [
        "intel"
      ],
      "commits": []
    }
  ]
}
